Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: གང་ཟག་ཏུ་སྨྲ་བ་མ་ཡིན་ཞིང་། སེམས་ཅན་དང་སེམས་ཅན་གྱི་ཁམས་ལ་ཡིད་ཀྱིས་མཆོག་ཏུ་མི་འཛིན་པ་ནས། མི་རྟོག་རྣམ་པར་མི་རྟོག་པའི་བར་དུའོ། །བཞིན་བཟངས་དག་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་ལ་མཆོག་ཏུ་མི་འཛིན་པ་ནས་མི་རྟོག་རྣམ་པར་མི་རྟོག་པའི་བར་དུའོ།
en: “Another quality, my friends, is that a noble son or daughter must not be attached to . . . and must not conceptualize or falsely identify forms, sounds, smells, flavors, or tactile perceptions.

source: །བཞིན་བཟངས་དག་གཞན་ཡང་རིགས་ཀྱི་བུ་དེ་ཁམས་གསུམ་དང་། དུས་གསུམ་དང་། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་ཀྱི་རྒྱུ་དང་། རྐྱེན་དང་། དམིགས་པ་དང་། འབྲས་བུ་རྣམ་པར་སྨིན་པ་འབྱུང་བ་དང་། གནས་དང་། སྐྱེ་བ་ཐམས་ཅད་ལ་མཆོག་ཏུ་མི་འཛིན་པ་ནས་མི་རྟོག་རྣམ་པར་མི་རྟོག་པའི་བར་དུའོ།
en: “Another quality, my friends, is that a noble son or daughter must not be attached to . . . and must not conceptualize or falsely identify the arising of the body based on the ripening of results dependent on causes, which happens throughout the three times and the threefold universe wherever there are the aggregates and the organs and objects of the senses.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ནི་སྤྱོད་པའི་གནས་ཀྱི་ཡུལ་ཐམས་ཅད་ལ་རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་དང་བྲལ་བ་སྟེ། མི་དམིགས་པའི་ཚུལ་གྱིས་སྤྱད་པར་བྱའོ། །བཞིན་བཟངས་དག་ཆོས་ཐམས་ཅད་དང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དངོས་པོ་མེད་པ་ཡིན་ཏེ། སྒྲ་མེད་པ།
en: It is because omniscient wisdom, devoid of all dualistic concepts and speculation with regard to the domain of conduct, is developed by means of the yoga of non-observation.

source: མཚན་མ་མེད་པ།
en: Neither phenomena nor omniscience, my friends, have any existence as separate entities.

source: ཡི་གེ་མེད་པ། སྨོན་པ་མེད་པ། སྐྱེ་བ་མེད་པ། འགག་པ་མེད་པ། མཚན་ཉིད་མེད་པ།
en: They make no sound, are signless, are not imperishable, are wishless, are not subject to arising or cessation, and have no characteristics.

source: ཆགས་པ་མེད་པ། དམིགས་པ་མེད་པ། བསྟན་དུ་མེད་པ། དབེན་པ།
en: They are unobstructed, imperceptible, and cannot be shown.

source: བདག་མེད་པ། མཚན་ཉིད་དང་བྲལ་བ། སྐད་ཅིག་པ། ཉེ་བར་ཞི་བ། མུན་པ་མེད་པ། སྣང་བ་མེད་པ། གནས་མེད་པ། ཡུལ་མེད་པ།
en: They are void, without self, and without characteristics. They are momentary, calm, neither dark nor light, and without location, and they are neither sense objects nor faculties.

source: དབང་པོ་མེད་པ། ཕྱོགས་མེད་པ། གཉེན་པོ་མེད་པ། བསམ་དུ་མེད་པ། མི་འཕྲོགས་པ།
en: They are neither friendly nor hostile, are inconceivable, and cannot be taken away.

source: སེར་སྣ་མེད་པ། སྤྲོས་པ་མེད་པ། རྡུལ་མེད་པ། རྡུལ་དང་བྲལ་བ། ཆ་ཤས་མེད་པ།
en: They are free from selfishness or mental elaboration, are stainless, and have no component parts.

source: ཅི་ཡང་མེད་པ། བྱེད་པ་པོ་མེད་པ། ཚོར་བ་པོ་མེད་པ། རྟེན་མེད་པ།
en: They are not anything in particular, not agents, devoid of sensations, and without support.

source: གཟུང་བ་མེད་པ། རྣམ་པར་རིག་པ་མེད་པ། སོ་སོར་སྣང་བ་མེད་པ། སྐད་ཅིག་པ་མ་ཡིན་པའི་བར་དུའོ།
en: They are ungraspable, cannot be cognized, do not appear discretely, and are not momentary.

source: །བཞིན་བཟངས་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་ནམ་མཁའ་དང་མཚུངས་ཏེ།
en: Omniscience, my friends, is sky-like and empty.

source: སྟོང་པ་ཉིད་པས་དམིགས་སུ་མེད་པའི་ཚུལ་དང་། མི་གནས་པའི་ཚུལ་དང་། མཆོག་ཏུ་འཛིན་པ་མེད་པའི་ཚུལ་དང་། མི་རྟོག་རྣམ་པར་མི་རྟོག་པའི་ཚུལ་གྱིས་སྤྱད་པར་བྱའོ།
en: Being emptiness, it should be engaged in by applying nonperception, nondwelling, nonattachment, nonconceptuality, and nonspeculation.

source: །བཞིན་བཟངས་དག་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་སྐྱེས་བུ་གང་ཟག་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ཞིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: “Endowed with these four qualities, my friends, a person will not fall into the hands of evil companions but instead swiftly realize unsurpassed and perfect awakening.

source: །བཞིན་བཟངས་དག་གང་ལ་ལ་ཡུལ་ཐམས་ཅད་ལ་ཆགས་པའི་ཡུལ་གྱི་མཚན་ཉིད་ཀྱི་གནས་ལ་རྣམ་པར་སྤྱོད་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཚོལ་ན། དེ་གཉིས་ལ་ཆགས་པ་ཡིན་ཏེ།
en: Anyone who seeks omniscient wisdom by treating sense objects as specifically located and characterized by being objects of attachment becomes bogged down in duality.

source: དེ་གཉིས་ལ་ཆགས་པའི་ཡིད་ཀྱིས་བརྣག་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སླུ་བར་བྱེད་དོ།
en: A mind bogged down in duality is conceptual and contradicts omniscience.

source: །དེ་ལ་གཉིས་གང་ཞེ་ན།
en: What is this duality?

source: གང་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་ལ་མཚན་ཉིད་དུ་རྣམ་པར་སྤྱོད་པས་གནས་པ་དང་། མཆོག་ཏུ་འཛིན་པ་དེ་ནི་གཉིས་ཏེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་སླུ་བའོ།
en: “When one dwells upon the aggregates, elements, and sense bases, by analyzing them according to their characteristics and becoming attached to them, this is duality and it runs counter to omniscience.

source: །སྤྱོད་པའི་གནས་དང་འབྲས་བུ་ལ་རྟོག་པ་འདི་ནི་གཉིས་སོ།
en: “Duality is conceptualizing the nexus of one’s conduct and its fruits.

source: །སྐྱེ་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་། སེམས་ཅན་གྱི་གནས་ལ་རྟོག་པ་འདི་ནི་གཉིས་སོ།
en: Duality is conceptualizing the nexus of appropriation, becoming, and birth of beings.

source: །བཤད་པ་དང་། རབ་ཏུ་བསྟན་པ་དང་། གདམས་པ་དང་། ཚིག་གི་ལམ་དང་། སྒྲ་དང་། སྐད་ཀྱི་གནས་ལ་རྟོག་པ་འདི་ནི་གཉིས་སོ།
en: Duality is conceptualizing the nexus of instruction, elucidation, discourse, terminology, and language.

source: །རྟག་པ་དང་། ཆད་པ་ལ་རྣམ་པར་ལྟ་བའི་ཤེས་པ་དང་། ཤེས་བྱའི་གནས་ལ་རྟོག་པ་འདི་ནི་གཉིས་སོ།
en: Duality is conceptualizing the nexus of knowledge consisting in eternalistic and nihilistic views, and subjects of knowledge.

source: །སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། བྱེད་པ་པོ་དང་། བྱེད་དུ་འཇུག་པ་པོའི་འདུ་ཤེས་ཀྱི་གནས་ལ་རྟོག་པ་འདི་ནི་གཉིས་སོ།
en: Duality is conceptualizing the nexus of notions that postulate a being, a vital principle, an individual soul, a person, an agent, or an instigator of action.

source: །གང་ཕ་རོལ་དང་། ཚུ་རོལ་དང་། རྟོག་པ་དང་། སེལ་བ་ལ་གནས་ཤིང་རྟོག་པ་འདི་ནི་གཉིས་སོ།
en: Also, if somebody dwells upon and conceptualizes the nexus of this shore and the other, and of thoughts and delimitations, this is duality.

source: །བཞིན་བཟངས་དག་སྐྱེས་བུ་གང་ཟག་སུ་ལ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཚོལ་བ་དེ་དུས་གསུམ་དུ་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་དང་། ཀུན་འབྱུང་བ་དང་། འགོག་པར་རྣམ་པར་དཔྱོད་པ་ལ་གནས་ཤིང་ཀུན་ཏུ་རྟོག་སྟེ། མཆོག་ཏུ་འཛིན་པ་འདི་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་དེའི་གཉིས་སོ། །འདི་ལྟ་སྟེ།
en: “My friends, if any person who seeks omniscience dwells upon, conceptualizes, speculates about, or gets attached to the analysis of the arising and cessation of the thoughts ‘I’ and ‘my’ throughout the three times, this is duality pertaining to omniscience.

source: དཔེར་ན་སྐྱེས་བུ་ལ་ལ་ཞིག་མེ་འདོད་པ་ལ་སའི་ངོས་ལ་ཉུག་པ་དང་། སྐོམ་འདོད་པ་ལ་མེ་དང་། ཟན་འདོད་པ་ལ་རྡོ་དང་། མེ་ཏོག་འདོད་པ་ལ་གོས་དང་། སྤོས་འདོད་པ་ལ་མི་རོ་བམ་པ་དང་། གོས་འདོད་པ་ལ་དུར་ཁྲོད་དང་། བྱུག་པ་འདོད་པ་ལ་ནམ་མཁའ་ལ་ཉུག་པ་དེ་བཞིན་དུ་བཞིན་བཟངས་དག་གང་སྤྱོད་པའི་གནས་ལ་ཆགས་ཤིང་རྣམ་པར་སྤྱོད་པའི་ལུས་གཉིས་ཀྱི་གནས་ཀྱིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཚོལ་ན་དེའི་འབད་པ་འབྲས་བུ་མེད་པ་ཡིན་ནོ།
en: “It is as if somebody would get hold of soil when they need fire, would get hold of fire when in need of drink, would get hold of a stone when in need of food, would get hold of garments when in need of flowers, would get hold of a corpse when in need of perfume, would get hold of rocks when in need of clothes, and would get hold of space when in need of scented oils. In this way, my friends, if anybody seeks omniscient wisdom while steeped in duality arising through the analysis of and attachment to the mastery of conduct, their endeavors will be fruitless.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུངས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བ་འཁོར་དེར་འདུས་པར་གྱུར་ནས་འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: There was, seated among this assembly, a bodhisattva by the name Dhāraṇamati.

source: །བཅོམ་ལྡན་འདས་གང་བརྗོད་དུ་མ་མཆིས་པ་དེ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་ལགས་སམ།
en: Folding his hands in the direction of the Blessed One, he bowed and asked, “Is it possible to realize that which is inexpressible?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་བརྗོད་དུ་མེད་པར་ཤེས་པ་དེ་ཉིད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ།
en: “Only one who knows the inexpressible is realized,” said the Blessed One.

source: །དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་ཉིད་ལ་དྲིས།
en: “Therefore, O noble son, I will ask you something.

source: ཁྱོད་ཀྱིས་ཇི་ལྟར་བཟོད་པ་དེ་བཞིན་དུ་ལན་ཐོབ་ཅིག །གང་ཐམས་ཅད་མཁྱེན་པའི་མིང་ཐོབ་པར་འགྱུར་བའི་རྫས་ཀྱི་མཚན་ཉིད་ཀྱི་དངོས་པོ་གང་ཡང་ཡོད་དམ།
en: Answer according to your degree of acceptance. If you are able to explain this, please do. Is there a substance, characteristic, or entity that is called ‘omniscience’?”

source: གསོལ་པ་གལ་ཏེ་མཆིས་ཞེས་བགྱིས་ན་ནི་རྟག་པར་འགྱུར།
en: “If I were to say that there is,” replied Dhāraṇamati, “this would be an eternalist view.

source: ཇི་སྟེ་མ་མཆིས་ཞེས་བགྱིས་ན་ནི་ཆད་པར་འགྱུར།
en: If I were to say that there isn’t, this would be a nihilist view.

source: དབུ་མའི་ལམ་ནི་དམིགས་སུ་མ་མཆིས་ཏེ།
en: In the middle way nothing can be apprehended:

source: དེ་ནི་མཆིས་པ་ཡང་མ་ལགས། མ་མཆིས་པ་ཡང་མ་ལགས་སོ། །གང་མ་ཆགས།
en: omniscience neither exists nor does not exist.

source: མི་སྐྱེ། མི་འགོག །ཚད་མ་མཆིས། གྲངས་མ་མཆིས། དཔེ་མ་མཆིས། སྣང་བ་མ་མཆིས་པ་དེ་ལ་འཚལ་བ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ།
en: Perfect realization is the understanding of the nature that is unobstructed, unarisen, unceasing, immeasurable, incalculable, without darkness, and without light.”

source: །བྱང་ཆུབ་སེམས་དཔའ་གློག་གི་བློ་གྲོས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་ལ་འགྲོ་བའང་མ་མཆིས། འོང་བའང་མ་མཆིས་པ་དེ་ལྟ་བུ་ཤེས་པ་ལ་འཇུག་པར་མཁས་པ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བྱེད་ཀྱིས་གསོལ་པ།
en: “Perfect awakening, O Blessed One,” said the bodhisattva Vidyunmati, “is the ability to gain realization where there is neither coming nor going.”

source: བཅོམ་ལྡན་འདས་གང་ན་ཐོབ་པའི་མཚན་ཉིད་ཀྱང་མ་མཆིས།
en: “Perfect awakening, O Blessed One,” said the bodhisattva Vairocana, “is the state that is characterized neither by attainment nor nonattainment.

source: མ་ཐོབ་པའི་མཚན་ཉིད་ཀྱང་མ་མཆིས། མངོན་པར་རྟོགས་པ་ཡང་མ་མཆིས། མངོན་དུ་བགྱི་བ་ཡང་མ་མཆིས། ཞི་བ་ཡང་མ་མཆིས། རབ་ཏུ་ཞི་བ་ཡང་མ་མཆིས།
en: It is not an intuitive grasp or an intuitive perception, nor is it tranquility or complete tranquility.

source: དུས་གསུམ་ཡང་མ་མཆིས། ཐེག་པ་གསུམ་ཡང་མ་མཆིས། སྨོན་ལམ་དང་ཡང་མཉམ་པའི་རློམ་སེམས་ཀྱང་མ་མཆིས་པ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་བློ་གྲོས་ཀྱིས་གསོལ་པ།
en: Neither is it the three times, the three vehicles, aspiration, civility, or conceitedness.”

source: བཅོམ་ལྡན་འདས་གང་ཁམས་གསུམ་ཡང་མ་མཆིས། ཀུན་ཏུ་སྦྱོར་བ་གསུམ་ཡང་མ་མཆིས། རིག་པ་གསུམ་ཡང་མ་མཆིས། ཐེག་པ་གསུམ་ཡང་མ་མཆིས། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ལ་རྟོག་པ་ཡང་མ་མཆིས། རྣམ་པར་རྟོག་པ་ཡང་མ་མ་མཆིས།
en: “Perfect awakening, O Blessed One,” said Dhāraṇamati, “is the state where one does not conceptualize or speculate about the threefold universe, the three fetters, the three types of knowledge, the three vehicles, the five aggregates, the elements, or the sense bases.

source: བྲི་བར་ཡང་མ་མཆིས། འཕེལ་བར་ཡང་མ་མཆིས་ལ། ཉམས་པར་ཡང་མི་བགྱིད་པ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ།
en: It is a state where there is no increase or decrease and that is not subject to deterioration.”

source: །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེ་བློ་གྲོས་ཀྱིས་གསོལ་པ། གང་སོ་སོའི་སྐྱེ་བོའི་ཆོས་དང་། འཕགས་པའི་ཆོས་དང་། སློབ་པའི་ཆོས་དང་། མི་སློབ་པའི་ཆོས་དང་། ཉན་ཐོས་ཀྱི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་མི་རྟོག་རྣམ་པར་མི་རྟོག་སྟེ། མཉམ་པར་ཡང་མི་བགྱིད་པ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་སྲ་བའི་བློ་གྲོས་ཀྱིས་གསོལ་པ།
en: “Perfect awakening,” said the bodhisattva Vajramati, “is the state where one does not conceptualize, speculate about, or defer to the teachings, whether those of ordinary people, the noble ones, the students, the adepts, the hearers, or those of the solitary buddhas.”

source: གང་དབེན་པའི་ཚུལ་གྱིས་དེ་བཞིན་ཉིད་ལ་རྣམ་པར་དཔྱོད་ཅིང་མངོན་པར་མི་ཞེན་པ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རིན་པོ་ཆེས་གསོལ་པ།
en: “Perfect awakening,” said the bodhisattva Dṛḍhamati, “is the state where, in the mode of disengagement, one does not analyze suchness.”

source: གང་ཆོས་ཐམས་ཅད་མི་སྐྱེ་བའི་མཚན་ཉིད་ཐོབ་པར་བགྱིད་པ་དང་། མངོན་པར་རྟོགས་པར་བགྱི་བའི་སླད་དུ་མི་རྟོག་པ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བསམ་གྱིས་མི་ཁྱབ་པས་གསོལ་པ།
en: “Perfect awakening,” said the bodhisattva Ratnapāṇi, “is the state where, for the sake of accomplishing or realizing the unborn characteristic of all phenomena, one does not conceptualize.”

source: གང་ཁམས་གསུམ་ལ་རྣམ་པར་སྤྱོད་ཅིང་སེམས་ཉིད་སེམས་ལ་འཇུག་པར་བགྱིད་དེ། སེམས་གཉི་ག་ལ་སེམས་ཀྱིས་རྣམ་པར་དཔྱོད་ན་མི་དམིགས་པ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་དགྲ་ལས་རྣམ་པར་རྒྱལ་གྱིས་གསོལ་པ། གང་ཆོས་ཐམས་ཅད་ལ་མི་ཆགས། རྗེས་སུ་མི་ཆགས། བཏང་སྙོམས་སུ་མི་བགྱིད།
en: “Perfect awakening,” said the bodhisattva Acintyamati, “is the state where one does not try to apprehend, through mental analysis, the two minds—the one that ponders the threefold universe and the one that ponders the analyzing mind.”

source: ཁོང་ཁྲོ་བར་མི་བགྱིད། འདོད་པར་མི་བགྱིད། མི་རྨོངས།
en: “Perfect awakening,” said the bodhisattva Arivijaya, “is the state where one does not cling to, does not become seduced by, indifferent to, angry at, desirous of, or deluded by, and does not grasp at or reject any phenomenon.”

source: མི་འཛིན། མི་གཏོང་བ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་སྙིང་པོས་གསོལ་པ། གང་བསོད་ནམས་དང་སྡིག་པ་ལ་མི་ཆགས་ཤིང་། ཟབ་མོ་ལ་བཟོད་པའི་ཚུལ་ལ་འཇུག་པས་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ལ་མི་རྟོག་པ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ།
en: “Perfect awakening,” said the bodhisattva Padmagarbha, “is the state where one is not attached to either virtue or vice and, through entering profound acceptance, does not conceptualize ‘I’ or ‘my.’ ”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་གསོལ་པ། གང་ཆོས་ཐམས་ཅད་ཆུ་ཟླ་དང་མཚུངས་པར་རབ་ཏུ་འཚལ་ཅིང་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་སོགས་པ་དང་། འབྲི་བར་ཡང་མི་མཐོང་བ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ།
en: “Perfect awakening,” said the princely youth Candraprabha, “is the state where one realizes all phenomena to be the same as the reflection of the moon in water and perceives the nature of phenomena as neither increasing nor decreasing.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་བློ་གྲོས་གཞོན་ནུར་གྱུར་པས་གསོལ་པ། གང་གི་སེམས་དང་སེམས་ལས་བྱུང་བ་ལ། མུན་པ་དང་། སྣང་བ་དང་། སྐྱེ་བ་དང་། འཇིག་པ་དང་། འཕེལ་བ་དང་། འབྲི་བ་ཐམས་ཅད་མི་འབྱུང་བ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ།
en: “Perfect awakening,” said the princely youth Khagamati, “is when there is no darkness, light, arising, decay, increase, or decrease within mind and mental states.”

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་གསོལ་པ། གང་གནས་པ་ལ་གནས་པ་ན་ཁམས་གསུམ་པ་ལ་གནས་པའི་ཚངས་པ་ལ་མི་དམིགས། མཉམ་པར་མི་བགྱིད་པ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་མི་ཟད་པས་གསོལ་པ།
en: “Perfect awakening,” said the bodhisattva Maitreya, “is the state where one neither apprehends nor attempts to become equal to the Brahmās that abide in the three realms of existence, wherever or whether they abide.”

source: གང་འཁོར་གསུམ་ཡོངས་སུ་དག་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་རབ་ཏུ་གོམས་པར་བགྱིད་ཅིང་།
en: “Perfect awakening,” said the bodhisattva Akṣayamati, “is the state where, by purifying the three spheres, one cultivates the perfections while knowing that there is no reality to them, and one is therefore neither attracted to nor indifferent to them.”

source: མི་ཆགས་མི་སྐྱོ་བ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་ཆོས་ཐམས་ཅད་ལ་མི་ཆགས་མི་སྐྱོ་ཞིང་ཆོས་ཟབ་མོའི་ཚུལ་ཡང་རབ་ཏུ་འཚལ་ཏེ།
en: “Perfect awakening, O Blessed One,” said the princely youth Mañjuśrī, “is the state where one is neither attracted to nor indifferent to phenomena and knows the profound doctrine of the Dharma.

source: གང་རབ་ཏུ་འཚལ་བ་དེ་ཡང་མི་ལེན་མི་འདོར།
en: One neither exerts oneself nor remains inert with regard to that which one cognizes.

source: སྡུད་པར་མི་བགྱིད། བྲལ་བར་མི་བགྱིད་ཅིང་། ཆོས་གང་ལ་ཡང་སོགས་པའམ། འབྲི་བའམ།
en: Nor does one accept or reject it.

source: རིག་པའམ། རྣམ་པར་གྲོལ་བའམ། འཇིག་པའམ། བྲི་བའམ། འཕེལ་བ་ཡང་མི་བསྐྱེད་ལ།
en: One does not accumulate, lose, generate knowledge of, relinquish, destroy, diminish, or increase any phenomena.

source: དངོས་པོ་དག་ལ་རྣམ་པར་མི་རྟོག་པས་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར་བ་འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་སྟེ།
en: By not conceptualizing things, one stops the afflictions.

source: ཚུལ་གཅིག་པོ་འདིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: It is by this single principle that one realizes omniscient wisdom.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྟད་མོ་ཅན་གྱིས་སྨྲས་པ། འཇམ་དཔལ་དེ་བཞིན་ཉིད་ལ་འཇུག་པའི་ཚུལ་འདི་ལྟར་ཟབ་མོ་སྟོང་པ་ཉིད་བསྒོམ་པའི་ཚུལ་འདི་གཅིག་གིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ན་ཀུན་ཏུ་སྦྱོར་བ་དང་། རབ་ཏུ་སྦྱོར་བར་ཅི་དགོས།
en: The bodhisattva Kautūhalika then asked, “How, O Mañjuśrī, should one apply the practices whereby one actualizes this single principle and subsequently acquires omniscient wisdom by cultivating profound emptiness?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī replied, “The following, noble children, are twenty methods for attaining omniscient wisdom.

source: ལྟ་བ་མི་བཟད་པ་དང་བྲལ་ཞིང་ཡང་དག་པའི་ལྟ་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། གཡོ་མེད་ཅིང་དྲང་པོར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། སྡིག་པ་དང་བྲལ་ཞིང་བླ་མ་ལ་རིམ་གྲོ་བྱ་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། བཀའ་བློ་བདེ་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། ཡང་དག་པའི་འཚོ་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། ཀུན་ཏུ་སྦྱོར་བ་ཐམས་ཅད་དང་བྲལ་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཁྲོ་བ་དང་སྙིང་རྗེ་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། སྟོན་པ་གསུམ་དུ་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། མི་སླུ་བའི་དགེ་བའི་ཆོས་སུ་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། རྣམ་པར་མ་ཞི་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། དམ་པའི་ཆོས་བསྲུང་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། སེམས་ཅན་ཉམ་ཆུང་བ་སྟོབས་ལ་རབ་ཏུ་དགོད་པར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། འཇིགས་པའི་སྐྱབས་མི་འཇིགས་པར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། ལམ་ངན་པར་ཞུགས་པ་རྣམས་ནན་ཏན་ལ་གཟུད་པར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། བཟོད་པ་དང་དེས་པར་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། འཛིན་པ་ཐམས་ཅད་ལ་ཆགས་པའི་མཚན་ཉིད་དུ་སྒྲོ་འདོགས་པ་ཡང་མེད་པ་དང་། རྡུལ་དང་མུན་པའི་ཕུང་པོ་ཐམས་ཅད་སྤོང་བར་སྒྲོ་འདོགས་པར་ཡང་མེད་པ་དང་། བསྔོ་བའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཐམས་ཅད་རྣམ་པར་སྤོང་བར་སྒྲོ་འདོགས་པར་ཡང་མེད་པ་འདི་དག་ནི་རིགས་ཀྱི་བུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སྦྱོར་བ་ཉི་ཤུ་སྟེ།
en: “One should abandon wrong views and adopt right views, adopt honesty and sincerity, respect the teacher without being tainted by negativity, be receptive to good advice, adopt right livelihood, cast off the fetters that bind one to saṃsāra, have the same anger-free compassion for all beings, take up the threefold restraint, sincerely adopt undeceptive wholesome mental states, avoid what is not peaceful, guard the sacred Dharma, never abandon any sentient being, renounce all wealth, give strength to the weak, offer refuge and fearlessness to the frightened, establish those who follow the wrong path in good behavior, be gentle and patient, adopt all the characteristics that curb grasping, avoid the accumulation of any impurities and darkness, and give up the expectation of the personal ripening of any fruits that have been dedicated.

source: ཡི་གེ་དང་། སྐད་དང་། སྒྲ་དང་། སྨྲ་བ་དང་། བརྗོད་པའི་ཚིག་རབ་ཏུ་དབྱེ་བ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་པ་ལ་འཇུག་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སྦྱོར་བའོ།
en: “Omniscient wisdom is applied through fathoming the knowledge of the nature of the divisions of all letters, languages, sounds, speech, and descriptive words.

source: །གཞན་མུ་སྟེགས་ཅན་གྱི་ཚིག་གི་དེ་བཞིན་ཉིད་ལ་འཇུག་པ་དང་། སྤྱོད་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལ་འཇུག་པ་དང་བསོད་ནམས་ཐམས་ཅད་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱོར་བའི་དེ་བཞིན་ཉིད་ལ་འཇུག་པ་དང་། ལེན་པ་དང་། སྐྱེ་བ་དང་། འཇིག་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལ་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་གསུམ་དང་། གནས་དང་། རྒྱུ་དང་། ལས་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལ་འཇུག་པས་དེ་བཞིན་གཤེགས་པའི་བཀའ་ཐམས་ཅད་ཤེས་ནས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སྦྱོར་བ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ལྟད་མོ་ཅན་གྱིས་སྨྲས་པ།
en: One has mastered the method of omniscience when one gains knowledge through fathoming the nature of the doctrine of all the thus-gone ones and of other religious doctrines; the nature of all conduct; the nature of applying all the merit and the perfection of insight; the nature of clinging, arising, and cessation; and the nature of the three emancipations, the abodes, the causes, action, and all phenomena.”

source: འཇམ་དཔལ་དེ་དེ་བཞིན་ཏེ།
en: “It is so, Mañjuśrī!” exclaimed the bodhisattva Kautūhalika.

source: ནམ་ཆོས་ཟབ་མོའི་ཚུལ་འདི་རྟོགས་པ་དེའི་ཚེ། ཆོས་གང་སྟོན་པ་དང་། གང་ལ་སྟོན་པ་དང་། དོན་དང་། ཚིག་དང་། ཡི་གེ་གང་དག་གིས་སྟོན་པ་དང་། རབ་ཏུ་སྟོན་པའི་ཆོས་གང་ཡང་མི་མཐོང་སྟེ།
en: “When one fully understands this profound Dharma principle, one does not see anyone who teaches the Dharma, anywhere it is taught, any meanings, words, and letters by means of which it is taught, or any Dharma that is taught.

source: གང་རབ་ཏུ་སྤོང་བ་དང་། གང་བསྒོམ་པ་དང་། གང་ཀུན་ཤེས་པར་འགྱུར་བའི་ཆོས་དེ་དག་ཐམས་ཅད་བརྗོད་དུ་མེད་པའི་ཚུལ་གྱིས་དེ་བཞིན་ཉིད་ལ་འཇུག་སྟེ།
en: Nor does one consider which Dharma one should abandon, which to practice, or which to understand thoroughly.

source: དེས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The one who can fathom the true nature of things as being inexpressible will realize omniscient wisdom.”

source: ལེགས་སོ་ལེགས་སོ།
en: good

source: །རིགས་ཀྱི་བུ་ཚུལ་གཅིག་གིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པ་དེ་ཁྱོད་ཀྱིས་ལེགས་པར་སྨྲས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Good it is, O noble son!” said the Blessed One. “You have eloquently shown that the attainment of omniscient wisdom can only happen through this single principle. Why is that?

source: ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་དངོས་པོ་ཡིན་པས་ཆོས་ཐམས་ཅད་ནི་སྒྲོ་བཏགས་པ་མེད་པ་དང་། མ་སྐྱེས་པ་དང་། མི་འཇིག་པའི་མཐའ་ཅན་དང་། མ་རིག་པ་དང་། མྱ་ངན་ལས་འདས་པ་མི་སྐྱེ་བའི་ཡང་དག་པའི་མཐའ་ཅན་དང་། ནམ་མཁའ་དང་། མྱ་ངན་ལས་འདས་པའི་མི་སྐྱེ་བའི་ཡང་དག་པའི་མཐའ་ཅན་དང་། ཆོས་ཐམས་ཅད་ནི་བརྗོད་དུ་མེད་པའི་མཐའ་ཅན་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱང་དེ་ལྟ་བུ་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་ནི་རྫས་མེད་པའི་མཐའ་ཅན་དང་། དུས་གསུམ་དང་། ཁམས་གསུམ་དང་། ཕུང་པོ་ཐམས་ཅད་ནི་ཅི་ཡང་མེད་པའི་མཐའ་ཅན་དང་། འདུ་བྱེད་གསུམ་ནི་སྟོང་པ་ཉིད་ཀྱི་མཐའ་ཅན་དང་། ཆོས་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་སྨིན་པའི་ཕུང་པོ་དང་། སོགས་པ་དང་། འབྲི་བའི་ཕུང་པོ་ནི་རྫས་མེད་པའི་མཐའ་ཅན་དུ་ཡོངས་སུ་བརྗོད་དོ།
en: It is because all phenomena, when they are not mere imputations, have an ultimate reality of neither arising nor decaying. Their ultimate reality is the nonarising of either ignorance or nirvāṇa and the nonarising of either space or nirvāṇa. Ultimately all phenomena are inexpressible. The same is true for all beings. Ultimately all phenomena are insubstantial and all are explained in terms of things coming together. Ultimately the three times, the threefold universe, and all the aggregates are nothing whatsoever. Ultimately, the three formations are empty.

source: །སྟོང་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བརྗོད་དུ་མེད་པའི་དོན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཆོས་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་འཇུག་གོ།
en: In their ultimate reality, the congeries of phenomena, ripening fruits of actions, accumulations, and dissolutions are insubstantial. Bodhisattva great beings attain omniscience when they are fully endowed with the understanding that all phenomena are ultimately empty and their meaning is inexpressible.”

source: །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པ་ལུང་བསྟན་པ་འདི་བཤད་པའི་ཚེ་བདུད་ཀྱི་བུ་མོ་དང་། བདུད་ཀྱི་བུ་ཚོགས་ཀྱི་འཁོར་ཉི་ཁྲིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་སྟེ།
en: At this time, while this explanatory discourse on acquiring omniscient wisdom was being presented, Māra ’s twenty thousand daughters and sons, along with their retinues, gained acceptance that phenomena are unborn.

source: ལུས་རགས་པ་སྤངས་ནས་ཡིད་ཀྱི་ལུས་རྙེད་དོ།
en: Accordingly, having renounced their gross physical forms, they attained mental bodies.

source: །གཞན་ཉི་ཁྲི་བརྒྱད་སྟོང་གིས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Another twenty-eight thousand beings also gained acceptance that phenomena are unborn.
